{"metadata":{"version":"1.0","name":"Random Sample Pack","created_at":"2025-06-15T15:05:45.426","lesson_count":3,"topics":["Predictive Modeling","Statistics & Experimentation","Statistics"]},"lessons":[{"short_name":"A/B Testing","concept_or_lesson":"Randomization in A/B Testing","definition_and_examples":"In an A/B test, randomization is crucial for ensuring that the treatment and control groups are equivalent before the test begins. This helps attribute any observed effects directly to the treatment being tested rather than other confounding factors. For example, if you have two groups of users where one receives treatment A and the other treatment B, you would need to ensure that both groups have similar characteristics. When assignments are truly random, we expect the proportion of users in each bucket to reflect what is intended, e.g., a 50/50 split in a simple A/B test.","question_or_exercise":"How can you check that assignment to various buckets in an A/B test is truly random?","answer":"You can do three things to check random assignment in A/B testing: 1. Test that the proportions of users in each bucket are as expected. If you expect a 50/50 split but observe a 70/30 split, this indicates a potential issue. 2. Use a difference in proportions test to compare the buckets. 3. Conduct a chi-squared test for independence to verify if the observed distributions are significantly different.","topic":"Predictive Modeling"},{"short_name":"Randomization in Experiments","concept_or_lesson":"Randomization in Experiments","definition_and_examples":"Randomization in experiments refers to the process of randomly assigning subjects or units to different treatment groups in order to ensure that any observed differences in outcomes can be attributed solely to the treatments applied. For example, in an A/B test where one group receives a new feature (treatment) and the other receives the existing version (control), randomization helps to ensure that any observed difference in user behavior is due to the feature and not other variables such as user demographics or previous usage patterns.","question_or_exercise":"What is the importance of randomization in experimental design?","answer":"Randomization ensures that confounding variables are evenly distributed across treatment groups, allowing for a clearer interpretation of the treatment effect.","topic":"Statistics & Experimentation"},{"short_name":"Chi-Square Tests","concept_or_lesson":"Chi-Square Test for Checking Distribution Equivalence","definition_and_examples":"The Chi-Square test is a statistical method used to determine if there is a significant difference between the expected frequencies and the observed frequencies in one or more categories. For example, if you have two buckets (A and B) of users and you want to check if the distribution of users by platform is similar across both buckets, you can use the Chi-Square test. If the p-value from the test is less than your significance level (commonly 0.05), you would reject the null hypothesis and conclude that the distributions are not the same.","question_or_exercise":"In an A/A test, you randomly divide users into two groups (A and A) and track their engagement metrics without any changes to the product features. Conduct a Chi-Square test to determine if the distributions of users in terms of platform and country are equivalent across both groups.","answer":"To perform the Chi-Square test, first, collect the observed counts of users in each category for both buckets. Then calculate the expected counts assuming the null hypothesis of no difference in distributions. Finally, apply the Chi-Square formula to find the test statistic and compare it with the Chi-Square distribution to find the p-value.","topic":"Statistics"}]}